RIET/src/InformationRegisters/НомераИнвойсовLawson/НомераИнвойсовLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераИнвойсовLawson</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Коммент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ОтчетАгентаПоРасходам</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Тикет</name>
    <type>
      <types>DocumentRef.Tickets</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/ПередачаОС/ПередачаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаОС</name>
  <comment>(Общ)</comment>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизации</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиВыручка_SB</registerRecords>
  <registerRecords>AccumulationRegister.КурсовыеРазницыSB</registerRecords>
  <registerRecords>AccumulationRegister.Выручка_SB</registerRecords>
  <registerRecords>AccumulationRegister.НДСНачисленный</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ВнереализационныеДоходыИРасходы</registerRecords>
  <registerRecords>InformationRegister.СостоянияОСОрганизаций</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиВзаиморасчетовПоИнвойсам</registerRecords>
  <registerRecords>AccumulationRegister.РегистрСебестоимости</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьАмортизацияОС</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведения</registerRecords>
  <registerRecords>AccumulationRegister.ИсполнениеБюджетаКонтракта</registerRecords>
  <registerRecords>AccumulationRegister.РасходыБудущихПериодов</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</registerRecords>
  <attributes>
    <name>ЭтоДокументИнтеркомпани</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеОС</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокПодготовкаКПередачеОС</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключенВСтоимость</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовПоАвансам</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАдресДоставки</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицоСдал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеДляСФ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьИННКППГрузополучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ОсновноеСредство</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКапитальныхВложенийВключаемыхВРасходыНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КостЦентр</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>РБП</name>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДСРуб</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСРуб</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предоплата</name>
    <attributes>
      <name>ДокументАванса</name>
      <type>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/CommonForms/ФормаНомеровLawsonУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда 
		Документ = Параметры.Документ; 
		ВалютаДокумента = Документ.ВалютаДокумента;
	КонецЕсли;
	
	ЗаполнитьТаблицуНомеров();
		
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	УстановитьВидимостьКоманд();
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
										
	ПриИзмененииДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДокумента()
	
	ЗаполнитьТаблицуНомеров();	
	
	ВалютаДокумента = Документ.ВалютаДокумента;
	 		
	УстановитьВидимостьКоманд();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКоманд()
	
	Элементы.НомераКоманднаяПанель.ПодчиненныеЭлементы.НомераПересчитатьВРуб.Видимость = ?((Не ЗначениеЗаполнено(ВалютаДокумента) Или ВалютаДокумента = ВалютаРегламентированногоУчета), Ложь, Истина);
	Элементы.НомераКоманднаяПанель.ПодчиненныеЭлементы.НомераЗаполнить.Видимость = ?(ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг"), Истина, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНомеров()
	
	Номера.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НомераИнвойсовLawson.Документ,
	|	НомераИнвойсовLawson.Номер,
	|	НомераИнвойсовLawson.Тикет,
	|	НомераИнвойсовLawson.Сумма,
	|	НомераИнвойсовLawson.СуммаДокумента,
	//|	НомераИнвойсовLawson.СтавкаНДС,
	|	НомераИнвойсовLawson.СуммаДокументаБезНДС,
	|	НомераИнвойсовLawson.ДатаLawson,
	|	НомераИнвойсовLawson.РучнаяКорректировка,
	|	НомераИнвойсовLawson.Валюта
	|ИЗ
	|	РегистрСведений.НомераИнвойсовLawson КАК НомераИнвойсовLawson
	|ГДЕ
	|	НомераИнвойсовLawson.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Номера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура НомераПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ЗаполнитьСтрокуПоДаннымДокумента(Элемент.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПоДаннымДокумента(Идентификатор)
	
	ТекСтрока = Номера.НайтиПоИдентификатору(Идентификатор);
	
	ТекСтрока.СуммаДокументаБезНДС = SalesBook.ОпределитьСуммуДокументаБезНДС(Документ);
	ТекСтрока.СуммаДокумента = ОбщегоНазначения.ПолучитьСуммуДокументаСНДС(Документ);
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если Документ.Товары.Количество() > 0 Тогда 
			ТекСтрока.СтавкаНДС = Документ.Товары[0].СтавкаНДС;
		ИначеЕсли Документ.Услуги.Количество() > 0 Тогда
			ТекСтрока.СтавкаНДС = Документ.Услуги[0].СтавкаНДС;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПередачаОС") Тогда
		ТекСтрока.СтавкаНДС = Документ.ОС[0].СтавкаНДС;
		ТекСтрока.Сумма = ТекСтрока.СуммаДокумента;
	КонецЕсли;
	
КонецПроцедуры

//КОМАНДЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	Для Каждого Запись Из Номера Цикл
		Если Запись.РучнаяКорректировка Тогда
			Предупреждение("Были произведены ручные корректировки. Автоматическое заполнение невозможно!");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Номера.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВложенныйЗапрос.Номер,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	//|	ВложенныйЗапрос.СтавкаНДС,  //Закомментировала Федотова Л., РГ-Софт, 22.03.13, вопрос SLI-0003408
	|	ВложенныйЗапрос.Ticket КАК Тикет,
	|	ВложенныйЗапрос.GLDate КАК ДатаLawson
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Ticket.SiebelOrder.LawsonInvoice КАК Номер,
	|		ВЫБОР
	|			КОГДА (НЕ РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС)
	|				ТОГДА РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|		КОНЕЦ КАК Сумма,
	//|		РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС, //Закомментировала Федотова Л., РГ-Софт, 22.03.13, вопрос SLI-0003408
	|		РеализацияТоваровУслугТовары.Ticket КАК Ticket,
	|		РеализацияТоваровУслугТовары.Ticket.SiebelOrder.GLDate КАК GLDate
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугУслуги.Ticket.SiebelOrder.LawsonInvoice,
	|		ВЫБОР
	|			КОГДА (НЕ РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС)
	|				ТОГДА РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|		КОНЕЦ,
	//|		РеализацияТоваровУслугУслуги.СтавкаНДС,  //Закомментировала Федотова Л., РГ-Софт, 22.03.13, вопрос SLI-0003408
	|		РеализацияТоваровУслугУслуги.Ticket,
	|		РеализацияТоваровУслугУслуги.Ticket.SiebelOrder.GLDate
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|	ГДЕ
	|		РеализацияТоваровУслугУслуги.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номер,
	//|	ВложенныйЗапрос.СтавкаНДС, //Закомментировала Федотова Л., РГ-Софт, 22.03.13, вопрос SLI-0003408
	|	ВложенныйЗапрос.Ticket,
	|	ВложенныйЗапрос.GLDate");
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Номера.Добавить();
		Запись.Документ = Документ;
		Запись.СуммаДокументаБезНДС = SalesBook.ОпределитьСуммуДокументаБезНДС(Документ);
		Запись.СуммаДокумента = ОбщегоНазначения.ПолучитьСуммуДокументаСНДС(Документ);
		Запись.Номер = Выборка.Номер;
		Запись.Сумма = Выборка.Сумма;
		//Закомментировала Федотова Л., РГ-Софт, 22.03.13, вопрос SLI-0003408
		//Запись.СтавкаНДС = Выборка.СтавкаНДС;
		Запись.Тикет = Выборка.Тикет;
		Запись.ДатаLawson = Выборка.ДатаLawson;
	КонецЦикла;
	          		
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНомера();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНомера()
	
	Если Не ЗначениеЗаполнено(Документ) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не заполнено поле ""Документ""!");
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НомераИнвойсовLawson.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Загрузить(Номера.Выгрузить());
	
	//Добавила Федотова Л, РГ-Софт, 26.11.13, вопрос SLI-0004006
	Для каждого Запись Из НаборЗаписей Цикл
	     Запись.Документ = Документ;
	КонецЦикла; 
	//
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не удалось записать данные, " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВРуб(Команда)
	
	ПересчитатьВРубНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВРубНаСервере()
	
	ВалютаUSD = Справочники.Валюты.НайтиПоКоду(840);
	
	Для Каждого Запись Из Номера Цикл
		КурсUSD = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаUSD, Запись.Документ.Дата);
	    СуммаТикетаВДолларах = Запись.Тикет.Сумма*(100+УчетНДС.ПолучитьСтавкуНДС(Запись.СтавкаНДС))/100;
		Запись.Сумма = СуммаТикетаВДолларах * КурсUSD.Курс / КурсUSD.Кратность;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НомераТикетПриИзменении(Элемент)
	
	ТекДанные = Элементы.Номера.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Тикет) Тогда
		ЗаполнитьСтрокуПоДаннымТикета(Элементы.Номера.ТекущаяСтрока, ТекДанные.Тикет);
	КонецЕсли;
	      		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПоДаннымТикета(Идентификатор, Тикет)
	
	ТекСтрока = Номера.НайтиПоИдентификатору(Идентификатор);
		
	ТекСтрока.РучнаяКорректировка = Истина;
	ТекСтрока.СтавкаНДС = Тикет.СтавкаНДС;
	ТекСтрока.ДатаLawson = Тикет.SiebelOrder.GLDate;
	ТекСтрока.Номер = Тикет.SiebelOrder.LawsonInvoice;
	 	
	ТекСтрока.Сумма = Тикет.Сумма*(100+УчетНДС.ПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС))/100;
	//ТекСтрока.СуммаДокументаБезНДС = SalesBook.ОпределитьСуммуДокументаБезНДС(ТекСтрока.Документ);  //SLI-0005521
	ТекСтрока.СуммаДокументаБезНДС = SalesBook.ОпределитьСуммуДокументаБезНДС(Документ);
	//ТекСтрока.СуммаДокумента = ОбщегоНазначения.ПолучитьСуммуДокументаСНДС(ТекСтрока.Документ);   //SLI-0005521
	ТекСтрока.СуммаДокумента = ОбщегоНазначения.ПолучитьСуммуДокументаСНДС(Документ);
	   	
КонецПроцедуры

&НаКлиенте
Процедура НомераНомерПриИзменении(Элемент)
	
	ТекДанные = Элементы.Номера.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда 
		ТекДанные.РучнаяКорректировка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомераСуммаДокументаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Номера.ТекущиеДанные;
	Если ВладелецФормы.ИмяФормы = "Документ.ПередачаОС.Форма.ФормаСпискаУправляемая" Тогда
		ТекДанные.Сумма = ТекДанные.СуммаДокумента;
	КонецЕсли;
КонецПроцедуры
